vbirjuko/EFM32_ROMI_Robot/profiler.c
/*
 * profiler.c
 *
 *  Created on: 17 мар. 2022 г.
 *      Author: wl
 */

#include "em_device.h"
#include "resources.h"
#include "profiler.h"
#include "Tachometer.h"
#include "Reflectance.h"
#include "LaunchPad.h"
#include "Motor.h"
#include "Maze.h"
#include "configure.h"
#include "Logging.h"
#include "benchmark.h"
#include "UART0.h"

#ifdef DEBUG_MAZE
#undef DATALOG
#endif

#ifdef DATALOG
#define LOGGING(A)       data_log(A, 1)
#else
#define LOGGING(A)
#endif


#define COMMAND_QUEUE_FACTOR  7
#define MINRPM  (800)

// 220mm per 360 tick of two wheels.
//#define CURRENT_DISTANCE  (((int32_t)LeftSteps + (int32_t)RightSteps) * 11L / (2*36))
#define CURRENT_DISTANCE    (STEPS_TO_MM((int32_t)LeftSteps + (int32_t)RightSteps))

int speed = 0;
int slowdistance, startdistance, guarddistance, wait_counter;

// Exchange data
volatile unsigned int segment_length, node_configuration, real_direction = north, profiler_data_ready = 0,
    profiler_queue_empty = 1, profiler_error_code = no_profiler_error;

volatile unsigned int command_queue[1ul << COMMAND_QUEUE_FACTOR], command_read_idx = 126, command_write_idx = 126;
volatile unsigned int block_command_read = 0;

void block_profiler(unsigned int state) {
  block_command_read = state;
}

unsigned int get_command(void) {
  unsigned int result;
  if (command_read_idx == command_write_idx) return command_eof;
  result = command_queue[command_read_idx++];
  command_read_idx &= (1ul << COMMAND_QUEUE_FACTOR) - 1;
  return result;
}

unsigned int read_command(unsigned int ahead) {
  unsigned int result = command_eof, new_idx;
  new_idx = command_read_idx;
  while (ahead--) {
      if (new_idx == command_write_idx) return command_eof;
      result = command_queue[new_idx];
      ++new_idx;
      new_idx &= ((1ul << COMMAND_QUEUE_FACTOR) - 1);
  }
  return result;
}

#ifndef DEBUG_MAZE

unsigned int put_command(unsigned int command_data) {
  if (((command_write_idx + 1) & ((1ul << COMMAND_QUEUE_FACTOR) - 1)) == command_read_idx) return 1;
  command_queue[command_write_idx] = command_data;
  __disable_irq();
  command_write_idx = (command_write_idx + 1) & ((1ul << COMMAND_QUEUE_FACTOR) - 1);
  __enable_irq();
  return 0;
}

#else

unsigned int put_command(unsigned int command_data) {
  switch (command_data & COMMAND_MASK) {
    case command_forward:
      UART0_OutString("Forward: ");
      UART0_OutUDec(command_data & ~COMMAND_MASK);
      UART0_OutString("\r\n");
      break;

    case command_turn:
      switch (command_data & ~COMMAND_MASK) {
        case 1:
          UART0_OutString("Turn Right\r\n");
          break;
        case 2:
          UART0_OutString("Turn Back\r\n");
          break;
        case 3:
          UART0_OutString("Turn Left\r\n");
          break;
        default:
          UART0_OutString("Turn Error in parameter: ");
          UART0_OutUDec(command_data & ~COMMAND_MASK);
          UART0_OutString("\r\n");
          break;
      }
      break;

    case command_finish:
      UART0_OutString("Finish ");
      UART0_OutUDec(command_data & ~COMMAND_MASK);
      UART0_OutString("\r\n");
      break;

    case command_entrance:
      UART0_OutString("Entrance ");
      UART0_OutUDec(command_data & ~COMMAND_MASK);
      UART0_OutString("\r\n");
      break;

    case command_wait:
      UART0_OutString("Wait ");
      UART0_OutUDec(command_data & ~COMMAND_MASK);
      UART0_OutString("\r\n");
      break;

    case command_back:
      UART0_OutString("Back ");
      UART0_OutUDec(command_data & ~COMMAND_MASK);
      UART0_OutString("\r\n");
      break;

    case command_benchmark:
      if (command_data & ~COMMAND_MASK) {
          UART0_OutString("Benchmark start\r\n");
      } else {
          UART0_OutString("Benchmark stop\r\n");
      }
      break;

    default:
      UART0_OutString("Unknown command ");
      UART0_OutUDec(command_data & ~COMMAND_MASK);
      UART0_OutString("\r\n");
      break;
  }
  return 0;
}
#endif

void drop_command_queue(void) {
  command_read_idx = command_write_idx = 0;
  profiler_data_ready = 0;
  speed = 0;
  Motor_Speed(speed, speed);
}

// функция движения по сегменту.
// Робот движется со скоростью maxspeed на участке slowdistance, затем сбавляет до minspeed.
// в пределах guarddist игнорируется пропадание линии и срабатывание боковых сенсоров.

unsigned int run_segment(void) {
  unsigned int activ_sensor_count, last_sensor, first_sensor, photo_mask;
  unsigned int blind, i;
  static int blindcount = 0, finishcount = 0, sigma_error = 0, prev_track_error = 0;
  int track_error, de_dt, left_speed, right_speed, result, maxspeed;

  if (photo_data_ready ) {
      photo_data_ready = 0;

      maxspeed = (CURRENT_DISTANCE > slowdistance) ? data.minspeed : data.maxspeed;

      blind = 1; activ_sensor_count = 0; last_sensor = 256; first_sensor = 256;

      photo_mask = current_sensor;
      LOGGING(log_segment | photo_mask);

      unsigned int mask = 0x01;
      for (i=0; i<8; i++) {
          if (photo_mask & mask) {
              blind = 0;
              activ_sensor_count++;
              last_sensor = i;
              if (first_sensor == 256) first_sensor = i;
          }
          mask <<= 1;
      }

      //  *  Теперь исходя из данных фотосенсоров пытаемся установить координаты линии.
      //  *  0 - центр, края +/- 332.
      //  * Если нет сигнала вообще - тупик - выход из подпрограммы.

      if (blind && CURRENT_DISTANCE >= guarddistance) {
          if (++blindcount > 2) {
              blindcount = 0;
              sigma_error = 0;
              finishcount = 0;
              segment_length = CURRENT_DISTANCE - startdistance + data.sensor_offset;
              return 1; // нет линии - тупик
          }
          track_error = prev_track_error;
      } else {
          blindcount = 0;
          if (CURRENT_DISTANCE >= guarddistance) {
              if ((photo_mask & 0x81) && ((last_sensor - first_sensor) == (activ_sensor_count - 1))) {
                  // есть срабатывание боковых датчиков - поворот или перекрёсток
                  if (++finishcount > 1) {
                      blindcount = 0;
                      sigma_error = 0;
                      finishcount = 0;
                      segment_length = CURRENT_DISTANCE - startdistance + data.sensor_offset;
                      return 1;
                  }                   // Ждём повторного срабатывания и выходим
              } else {
                  finishcount = 0;    // Если нет повторного - показалось.
              }
              // Для ПИД коррекции сужаем аппертуру сенсоров, участвующих в вычислении ошибки позиции
              // так как к этому времени робот уже должен быть стабилизирован на линии. - нет, что-то не то.
              if (first_sensor < 2) first_sensor = 2;
              if (last_sensor  > 5) last_sensor  = 5;
          }
          track_error = line_error(first_sensor, last_sensor);
      }

      // Теперь имеем значение ошибки/смещения и дифференциальное значение ошибки

      de_dt = data.k_diff*(track_error - prev_track_error);
      prev_track_error = track_error;

